---
type: WireSizeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# WireSizeSet

`Autodesk.Revit.DB.Electrical.WireSizeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WireSizeSet | — | `public WireSizeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( WireSize item )` |
| Method | Erase | — | `public virtual int Erase ( WireSize item )` |
| Method | ForwardIterator | — | `public virtual WireSizeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( WireSize item )` |
| Method | ReverseIterator | — | `public virtual WireSizeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |